app/controllers/items_controller.rb

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 317], ["LIMIT", 1]]
---
  def new
    @merchant = Merchant.find(params[:merchant_id])