app/controllers/items_controller.rb

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."merchant_id" = $1 AND (status > 0)  [["merchant_id", 1]]
SELECT "items".* FROM "items"
SELECT "merchants".* FROM "merchants"
---
    def index

      if params[:merchant_id] && params[:status] == "0"
          @items = Merchant.find(params[:merchant_id]).items.where("status = 0")
      elsif params[:merchant_id] && params[:status] != "0"
          @items = Merchant.find(params[:merchant_id]).items.where("status > 0")
      elsif params[:status] == "0"
          @items = Item.where("status = 0")
      elsif params[:status] != "0"
          @items = Item.where("status > 0")
      else
          @items = Item.all

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "items" ("name", "description", "price", "image_url", "inventory", "merchant_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "The Best Thing"], ["description", "It's the BEST"], ["price", 8.99], ["image_url", "the best image link"], ["inventory", 400], ["merchant_id", 2]]
---
    def create
      merchant = Merchant.find(params[:merchant_id])
      item = merchant.items.create!(items_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "items" SET "name" = $1, "description" = $2, "price" = $3, "image_url" = $4, "inventory" = $5 WHERE "items"."id" = $6  [["name", "Sunglass is"], ["description", "You can't see at night."], ["price", 14.99], ["image_url", "last lengthy link"], ["inventory", 5], ["id", 268]]
---
    def update
      @item = Item.find(params[:id])
        if @item.update_attributes(items_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "status" = $1 WHERE "items"."id" = $2  [["status", 0], ["id", 2]]
---
    def activate
      @item = Item.find(params[:id])
      @item.update_attributes(status: 0)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "status" = $1 WHERE "items"."id" = $2  [["status", 1], ["id", 2]]
---
    def deactivate
      @item = Item.find(params[:id])
      @item.update_attributes(status: 1)