app/controllers/merchants_controller.rb

SELECT "merchants".* FROM "merchants"
---
  def index
    @merchants = Merchant.all

INSERT INTO "merchants" ("name", "address", "city", "state", "zip") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Paul Schlattmann"], ["address", "19350 Misty Morning Drive"], ["city", "Monument"], ["state", "CO"], ["zip", 80132]]
---
  def create
    @merchant = Merchant.new(merchant_params)

    respond_to do |format|
      if @merchant.save

UPDATE "merchants" SET "name" = $1, "address" = $2, "city" = $3, "state" = $4, "zip" = $5, "updated_at" = $6 WHERE "merchants"."id" = $7  [["name", "The Codfather"], ["address", "Paramount Pictures Ave."], ["city", "NY"], ["state", "NY"], ["zip", 1972], ["updated_at", "2019-06-27 23:02:51.184202"], ["id", 437]]
---
  def update
    respond_to do |format|
      if @merchant.update(merchant_params)

DELETE FROM "merchants" WHERE "merchants"."id" = $1  [["id", 1]]
---
  def destroy
    @merchant.destroy

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 494], ["LIMIT", 1]]
---
    def set_merchant
      @merchant = Merchant.find(params[:id])